# -*- coding: utf-8 -*-
# -*- author: JeremySun -*-
# -*- dating: 20/5/14 -*-

# 利用计数和拉普拉斯平滑的二元模型代码


"""
假设输入文本A已经分词并加入标识符<s>、</s>，每句话为一个列表。
vocab为所有单词的列表，K为拉普拉斯平滑的参数。
例子：
    输入：
    A = [
    ['<s>', '今天', '天气', ‘不错', '</s>'],
    ['<s>', '我们', '今天', '去', '划船', '</s>'],
    ['<s>', '我们', '今天', '去', '开会', '</s>']]
    vocab = ['<s>', '</s>', '今天', '我们', '天气', '不错', '去', '划船', '开会']
    调用bigram(A, vocab, K)
    输出二元模型概率。
"""


def bigram(A, vocab, K):
    cnt = {word: 0 for word in vocab}  # cnt[word]是word在文本中出现的次数
    cnt2 = {word: {word2: 0 for word2 in vocab} for word in vocab}  # cnt2[word][word2]是word、word2在文本中出现的次数（word2在后）
    for sent in A:
        for i, word in enumerate(sent):
            cnt[word] += 1
            if i + 1 < len(sent):
                cnt2[word][sent[i + 1]] += 1  # 索引i的紧接着1位
        for word in cnt2:
            for word2 in cnt2[word]:
                prob = (cnt2[word][word2] + K) / (cnt[word] + K * len(vocab) + 0.0)  # 拉普拉斯平滑
                print('P({0}|{1})={2}'.format(word2, word, prob))


A = [['<s>', '今天', '天气', '不错', '</s>'],
     ['<s>', '我们', '今天', '去', '划船', '</s>'],
     ['<s>', '我们', '今天', '去', '开会', '</s>']]
vocab = ['<s>', '</s>', '今天', '我们', '天气', '不错', '去', '划船', '开会']
bigram(A=A, vocab=vocab, K=1)


"""
cnt:
    {'<s>': 3,
     '</s>': 3,
     '今天': 3,
     '我们': 2,
     '天气': 1,
     '不错': 1,
     '去': 2,
     '划船': 1,
     '开会': 1}

cnt2:
    {'<s>': {'<s>': 0,
      '</s>': 0,
      '今天': 1,
      '我们': 2,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 0,
      '开会': 0},
     '</s>': {'<s>': 0,
      '</s>': 0,
      '今天': 0,
      '我们': 0,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 0,
      '开会': 0},
     '今天': {'<s>': 0,
      '</s>': 0,
      '今天': 0,
      '我们': 0,
      '天气': 1,
      '不错': 0,
      '去': 2,
      '划船': 0,
      '开会': 0},
     '我们': {'<s>': 0,
      '</s>': 0,
      '今天': 2,
      '我们': 0,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 0,
      '开会': 0},
     '天气': {'<s>': 0,
      '</s>': 0,
      '今天': 0,
      '我们': 0,
      '天气': 0,
      '不错': 1,
      '去': 0,
      '划船': 0,
      '开会': 0},
     '不错': {'<s>': 0,
      '</s>': 1,
      '今天': 0,
      '我们': 0,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 0,
      '开会': 0},
     '去': {'<s>': 0,
      '</s>': 0,
      '今天': 0,
      '我们': 0,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 1,
      '开会': 1},
     '划船': {'<s>': 0,
      '</s>': 1,
      '今天': 0,
      '我们': 0,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 0,
      '开会': 0},
     '开会': {'<s>': 0,
      '</s>': 1,
      '今天': 0,
      '我们': 0,
      '天气': 0,
      '不错': 0,
      '去': 0,
      '划船': 0,
      '开会': 0}}
可以看出cnt和cnt2是用来记录单独一个词和连续两个词出现的次数。
"""