机器阅读理解是一种利用算法使计算机理解文章语义并回答相关问题的技术，属于自然语言处理范畴。

1.1 机器阅读理解任务

	1.1.1 机器阅读理解模型

		机器阅读理解模型的输入为文章和问题的文本，输出为最终的回答。为了完成任务，模型需要
		深度分析文章语义以及文章和问题之间的联系，然后根据文章中的内容最初准确回答。当前绝
		大多数机器阅读理解模型算法都是采用深度学习模型，利用深度神经网络进行建模与优化。深
		度学习的特点是模型能根据训练集上预测的准确度直接优化函数，不断提高模型性能，从而达
		到很好的效果。

		由于深度学习需要在数值空间处理信息，因此阅读理解模型首先要对文章和问题进行数字化表
		示，形成文本编码。常见的方法是词向量：将文本分成若干单词，然后用一串数字（即一个向
		量）	表示一个单词。接下来，机器阅读理解模型会对这些数字化编码进行各种操作，获得上下
		文信息以及文章和问题之间的语义关联，从而获取有关答案的线索。一般而言，基于深度学习
		的机器阅读理解模型的架构包括3个部分：
			1、编码层：对文章和问题进行单词编码，并完成上新闻语义分析；
			2、交互层：处理文章和问题之间的关联信息，找出文章中问题相关的线索；
			3、输出层：将之前处理的信息按照任务要求生成答案。
		由于生成大批量标注数据需要花费大量的时间和人力。因此，近年来NLP界提出了预训练+微调
		模式：在大量无标注文本数据上训练大规模模型，然后在少量具体任务的标注数据（如阅读理
		解）上进行微调。这种模式取得了很好的效果，也有效缓解了标注数据缺乏的问题。

	1.1.2 机器阅读理解模型的应用
		凡事需要自动处理和分析大量文本内容的场景下，机器阅读理解模型都可以帮助人类节省大量
		的人力和时间。

1.2 自然语言处理

	1.2.1 研究现状

		经过70余年的发展，自然语言处理相关研究已经细化分类成许多个子任务。以下是与机器阅读理解
		相关的重要研究方向：
			1、信息检索（introduction retrieval）。该领域的研究已经相当成熟。当一个阅读理任务
			涉及到大规模文本库时，信息检索通常作为系统中抽取相关信息的第一模块。
			2、问答系统（question and answering system）问答系统与信息检索的主要区别在于，问
			答系统需要理解复杂的语义，并支持多轮有上下文的对话。例如，对话式阅读理解需要模型同
			时分析文章语义和之前对话轮次的信息，再对当前问题作出回答。
			3、文本分类（text classification）。一些机器阅读理解模型对问题进行分类，如关于时间
			的问题，关于地点的问题，以提高答案的准确性。
			4、机器翻译（machine translation）。研究如何让计算机自动翻译文本，可以应用在跨语言
			的阅读理解任务中。
			5、文本摘要（text summarization）。由于文本摘要需要对文章语义进行分析并生成结果，其
			中很多技术被应用到机器翻译中，例如序列到序列模型（sequence-to-sequence），拷贝-生
			成网络（pointer-generator network）等。

	1.2.2 仍需解决的问题

		目前NLP领域仍有许多没有很好解决的问题，其中也包括对基本语言结构和语义的理解这些也是机器
		阅读理解研究中亟待解决的问题。
		1、语言的歧义性
			如果有充足的上下文信息，歧义就会消除。然而到目前为止，自然语言处理的模型仍不能很好地
			理解上下文的语义。已有的模型很大程度上基于单词或关键词进行匹配，这也导致这些模型对于
			歧义性文本的处理能力很低。
		2、推理能力
			近年来已经出现常识和推理在自然语言处理应用上的研究，但如何让模型包含海量的常识并进行
			有效的推理仍是一个需要解决的问题。

1.3 深度学习
	
	1.3.1 深度学习的特点

		1、深度学习具有很大的模型复杂度
		2、深度学习具有强大的特征学习能力
		3、深度学习可以实现端到端（end-to-end）的学习
		4、硬件的更新换代，特别是GPU计算能力的不断改进
		5、深度学习框架的出现和社区的繁荣

	1.3.2 深度学习的成果

		在语音、图像、文本等多个领域均有优异表现。

1.4 机器阅读理解的评测方式
	
	1.4.1 机器阅读理解的答案形式

		1、多项选择式
		2、区间问答式
		3、自由回答式
		4、完形填空式
		5、此外，一些数据集还设置了‘无答案’问题，需要模型输出‘无法回答’(unanswerable)

	1.4.2 自由回答式答案评分标准ROUGE

		ROUGE(Recall-Oriented Understudy for Gisting Evaluation)是一种基于召回率的文本相似性
		度量方法，用于衡量标准答案中的单词和短语在模型答案中出现的比例。主要有ROUGE-N、ROUGE-S和
		ROUGE-L等指标。

1.5 机器阅读理解数据集
	
	根据数据集中阅读文章的形式，可以将这些数据集分为单段落、多段落和可检索的文本库3种类型

	1.5.1 单段落式数据集

		1、RACE
		2、NewsQA
		3、CNN/Daily Mail
		4、SQuAD
		5、CoQA

	1.5.2 多段落式数据集

		1、MS MARCO
		2、DuReader
		3、QAngaroo
		4、HotpotQA

	1.5.3 文本库式数据集

		1、ARC

1.6 机器阅读理解数据的生成
	
	常采用的处理方式为众包(crowdsourcing)模式，即雇佣标注者生成数据集。

	1.6.1 数据集的生成

		机器阅读理解数据集的3个核心概念是文章、问题和答案。由于答案可以根据问题从文章中推理得出，因此
		如何收集文本和问题是生成数据及的首要任务。下面来分析两种常见的数据集生成方式：从文本生成问题
		和从从问题生成文本。

		1、从文本生成问题

			从文本生成问题的优势在于：问题和文本十分相关，不会涉及给定段落以外的信息，适用于生成单段
			落或多段落式机器阅读理解数据集。但是，由于标注者根据文本人工产生问题，很可能造成问题语言不
			自然，导致生成的问题和实际应用中用户提出的问题的关注点和语言习惯不同。

		2、从问题生成问题

			该方法的优势在于：问题来源于用户的真是查询，有很强的应用价值并且文章由搜索引擎自动检索得
			到。但是这种方法无法保证一定可以从文本中得到正确答案，因此需要标注者进行验证和处理。

	1.6.2 标准答案的生成

		标准答案的产生通常也采用众包的形式。标注者需要根据答案类型的要求，如区间式、自由答案式等，给出
		简洁、正确的答案。由于机器阅读理解问题答案的标注者是人类，所以我们常可以在相关报道中见到“人类
		表现”或“人类水平”这样的描述。那么人类水平是如何定义的呢？
		首先，绝对正确的答案是无法获得的。因此，在所有需要人工标注答案的机器阅读理解数据集中，一般采用
		多个标注者的答案集合或投票结果作为准确率为100%的标准答案，而人类水平是指单个标注者的正确率。例
		如，SQuAD1.1中采用3个标注者对每个问题生成答案，人类水平是指将第一、第三个标注者的答案作为标准
		答案，计算第二个标注者答案的准确率。

	1.6.3 如何设计高质量的数据集

		本节将分析一个高质量的机器阅读理解数据集应该具备哪些特点。

		1、区分基于理解和匹配的模型
			
			一个高质量的机器阅读理解数据集需要能够避免让简单文本匹配方法在评测中获得高分。例如，在SQuAD
			2.0版本的数据集生成过程中，标注者被要求利用文章中的关键词组合生成“无法回答”的问题，且这类
			问题在整个数据集中占比达到35%，这有效降低了依赖关键词匹配的模型的得分。这也成为许多新的阅读
			理解数据集的生成标准之一。

		2、考察模型的推理能力

			多步推理是阅读理解数据集重点考察的指标之一。有一种方法是从真实的用户问题中筛选出需要推理的问
			题，检索得到相关文档，然后将文本信息按照推理的每一步分成多个段落和部分。这样也可以达到考察模
			型综合推理能力的目的。

		3、考察模型的常识能力

			常识(common sense)是人类重要的认知能力之一，而对常识的理解和运用恰恰是自然语言处理和机器学
			习的短板。这首先是因为常识知识的规模很大，定义比较模糊，很难完全总结；其次是因为很难将尝试进
			行有效的表示和应用。此外，基于常识的阅读理解数据集很是罕见，较为著名的是CommonsenseQA。

		4、其他理解能力

			2017年，有学者指出机器阅读理解模型应该具有如下10项技能：

				01.枚举与列举
				02.数学运算
				03.指代消除。
					指代消除本身也是自然语言处理中的核心任务之一，即理解“这个”、“那个”、“他”、“她”等代词
					的指代对象，从而回答问题。
				04.逻辑推理
				05.类比和比喻
				06.时空关系
				07.因果关系
					理解因果关系对于回答“为什么”(why)类型的问题非常重要。
				08.常识推理
				09.修辞理解
				10.特殊语言结构
					一些使用频率较低的原因结构，如倒装、虚拟语气等，往往会增加理解文章的难度。

		当前的研究，特别是与深度学习相关的研究，很大程度上还依赖于统计层面的模式识别和匹配，缺乏许多人类
		阅读理解必备的技能，而且很难像人类一样对答案给出合理的解释。这些都是机器阅读理解需要解决的问题。